{
  "Tackle Tanks":{
    "Sub":"Online Tank PvP",
    "Release":"November 23, 2022",
    "Price":"FREE",
    "Tags":["PvP","PvE","Multiplayer","Action","Casual","Deathmatch","Vehicles","Online Interactive", "PC"],
    "Summary":"Battle with your buddies and defeat enemy tanks in this online multiplayer tank game. With 15 tanks to choose from and a plethora of game options, earn scarps to unlock new skins! Airstikes? Napalm? Missles? Drones? Use all sorts of warfare against the enemy!",
    "Links":{  
      "Online":"https://leechlab.github.io/Tackle-Tanks/"
    },
    "Media":{
      "Title":"https://raw.githubusercontent.com/LeechLab/LeechLab-Website/96b4ecb35ccbb6b23bf17d1be6edcaf8f11905a7/Game-Index-Images/TackleTanks-Title.svg",
      "Banner":"https://raw.githubusercontent.com/LeechLab/Tackle-Tanks/refs/heads/main/Sources/CSS/lobby_images/tdb1.png",
      "Regular":["https://leechlab.github.io/Tackle-Tanks/HTML_images/Guide_Html/ttiov1.png",
        "https://raw.githubusercontent.com/LeechLab/Tackle-Tanks/refs/heads/main/HTML_images/Guide_Html/TTversionDifferences.png",
        "https://leechlab.github.io/Tackle-Tanks/HTML_images/Guide_Html/tdg2.png",
        "https://leechlab.github.io/Tackle-Tanks/HTML_images/mudlands.png",
        "https://leechlab.github.io/Tackle-Tanks/HTML_images/desert.png",
        "https://leechlab.github.io/Tackle-Tanks/HTML_images/tropical.png",
        "https://leechlab.github.io/Tackle-Tanks/HTML_images/shipyard.png"]
    },
    "About": ["Tackle Tanks is a thrilling, top-down multiplayer IO game where two teams (Green and Brown) go head-to-head in chaotic, strategic warfare. Players can dive into a variety of dynamic game modes, including Team Deathmatch, Capture the Bases, Zombies, and more, each offering a unique objective and way to play. The heart of the game lies in its wide roster of 15 playable tanks, ranging from the versatile Cannon and rapid-fire Minigun to the area-denying Napalm and long-range Sniper. Each tank has its own strengths, weaknesses, and two special abilities that can turn the tide of battle, encouraging experimentation and teamwork in every match.","The action takes place across several hand-crafted maps, each with distinct environments and tactical layouts. Whether you’re navigating the open fields of Grasslands, the tight corridors of Shipyard, or the eerie shadows of Night Mode, the map variety keeps gameplay fresh and engaging. As you play, you’ll collect 'scraps,' a form of in-game currency earned through performance. These scraps can be used to unlock a range of tank skins in the shop, giving players the chance to customize their appearance and show off their achievements. Tackle Tanks blends arcade-style fun with light strategic depth, making it accessible to new players while offering layers of nuance for competitive ones.","The game was originally inspired by the explosion of IO games on the web. We built the first version of Tackle Tanks in JavaScript, HTML5, and CSS, launching the game in November 2022. Since then, the game has undergone several major updates, including the addition of new tanks, improved mechanics, dual abilities, refined gunplay, environmental objects, and an in-game economy. What began as a fun experiment has grown into a multiplayer experience enjoyed by players of all ages. Tackle Tanks continues to evolve with each update, and welcomes everyone—casual gamers, strategy fans, and competitive players alike—to join the fight."]
  }
}
